#include <stdio.h>

int main(void) {
  // Оголошення змінних для збереження введеного числа та окремих цифр
  int number;
  int number1, number3;

  // Виведення повідомлення для введення числа
  printf("\n Будь ласка, введіть трьохзначне число: ");
  // Зчитування введеного числа з консолі
  scanf("%d", &number);

  // Визначення третьої цифри та першої цифри введеного числа
  number3 = number % 10;
  number1 = number / 100;

  // Виведення заголовка для виведення значень першої та третьої цифр
  printf("\n Перше   Третє\n");
  // Виведення значень першої та третьої цифр відповідно
  printf(" число  число\n");
  printf("  %d\t      %d\t\n", number1, number3);
  return 0;
}